# **QUERY RESPONSE**

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///trial.db

In [3]:
%%sql CREATE TABLE Worker(
    name VARCHAR(25),
    salary INT,
    weights DECIMAL(5,2)
);

 * sqlite:///trial.db
Done.

[]

In [4]:
%%sql INSERT INTO Worker VALUES
('Naomi',20000,2.5)

 * sqlite:///trial.db
1 rows affected.

[]

In [5]:
%%sql pragma table_info(Worker);

 * sqlite:///trial.db
Done.

[(0, 'name', 'VARCHAR(25)', 0, None, 0),
 (1, 'salary', 'INT', 0, None, 0),
 (2, 'weights', 'DECIMAL(5,2)', 0, None, 0)]

In [6]:
%%sql select * from Worker;

 * sqlite:///trial.db
Done.

[('Naomi', 20000, 2.5)]

In [7]:
%%sql INSERT INTO Worker VALUES
('Dave',20000.55,2)

 * sqlite:///trial.db
1 rows affected.

[]

In [8]:
%%sql select * from Worker;

 * sqlite:///trial.db
Done.

[('Naomi', 20000, 2.5), ('Dave', 20000.55, 2)]

In [ ]:
%sql DELETE FROM Worker WHERE name == 'Naomi';

 * sqlite:///trial.db
1 rows affected.

[]

In [ ]:
%%sql select * from Worker;

 * sqlite:///trial.db
Done.

[('Dave', 20000.55, 2)]

**STRICT TABLES**

In a CREATE TABLE statement, if the "STRICT" table-option keyword is added to the end, after the closing ")", then strict typing rules apply to that table. The STRICT keyword causes the following differences:

Every column definition must specify a datatype for that column. The freedom to specify a column without a datatype is removed.

The datatype must be one of following:

INT
INTEGER
REAL
TEXT
BLOB
ANY

In [12]:
%%sql CREATE TABLE Workers(
    name TEXT,
    salary INTEGER,
    weights REAL
)STRICT;

 * sqlite:///trial.db
Done.

[]

In [13]:
%%sql INSERT INTO Workers VALUES
('Dave',20000.55,2)

 * sqlite:///trial.db
(sqlite3.IntegrityError) cannot store REAL value in INTEGER column Workers.salary
[SQL: INSERT INTO Workers VALUES
('Dave',20000.55,2)]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [14]:
%%sql INSERT INTO Workers VALUES
('Naomi',20000,2.55)

 * sqlite:///trial.db
1 rows affected.

[]

In [15]:
%%sql select * from Workers;

 * sqlite:///trial.db
Done.

[('Naomi', 20000, 2.55)]

**Truncation**

**Mac Unzipping the file**

In [3]:
%sql sqlite:///trial2.db

In [4]:
%%sql CREATE TABLE new(
    name VARCHAR(25),
    salary INT,
    weights DECIMAL(5,2)
);

   sqlite:///trial.db
 * sqlite:///trial2.db
Done.

[]

In [5]:
%%sql INSERT INTO new (name,salary,weights) VALUES
("Naomi",20000,10)

   sqlite:///trial.db
 * sqlite:///trial2.db
1 rows affected.

[]

In [6]:
%sql SELECT * FROM new;

   sqlite:///trial.db
 * sqlite:///trial2.db
Done.

[('Naomi', 20000, 10)]

In [7]:
%%sql INSERT INTO new (name,salary,weights) VALUES
("Winnie",50000,10.00)

   sqlite:///trial.db
 * sqlite:///trial2.db
1 rows affected.

[]

In [8]:
%sql SELECT * FROM new;

   sqlite:///trial.db
 * sqlite:///trial2.db
Done.

[('Naomi', 20000, 10), ('Winnie', 50000, 10)]

In [9]:
%%sql INSERT INTO new (name,salary,weights) VALUES
("Robert",70000,9.80);

   sqlite:///trial.db
 * sqlite:///trial2.db
1 rows affected.

[]

In [10]:
%sql SELECT * FROM new;

   sqlite:///trial.db
 * sqlite:///trial2.db
Done.

[('Naomi', 20000, 10), ('Winnie', 50000, 10), ('Robert', 70000, 9.8)]

In [11]:
%%sql SELECT SUM(weights)
FROM new;

   sqlite:///trial.db
 * sqlite:///trial2.db
Done.

[(29.8,)]

In [12]:
%%sql SELECT CAST(weights AS DECIMAL(10, 2)) AS formatted_value
FROM new;

   sqlite:///trial.db
 * sqlite:///trial2.db
Done.

[(10,), (10,), (9.8,)]

In [13]:
%%sql ALTER TABLE new
ADD COLUMN bmi REAL;

   sqlite:///trial.db
 * sqlite:///trial2.db
Done.

[]

In [14]:
%sql PRAGMA table_info("new");

   sqlite:///trial.db
 * sqlite:///trial2.db
Done.

[(0, 'name', 'VARCHAR(25)', 0, None, 0),
 (1, 'salary', 'INT', 0, None, 0),
 (2, 'weights', 'DECIMAL(5,2)', 0, None, 0),
 (3, 'bmi', 'REAL', 0, None, 0)]

In [15]:
%%sql INSERT INTO new (name,salary,weights,bmi) VALUES
("Jane",40000,12.50,20.00);

   sqlite:///trial.db
 * sqlite:///trial2.db
1 rows affected.

[]

In [16]:
%sql SELECT * FROM new;

   sqlite:///trial.db
 * sqlite:///trial2.db
Done.

[('Naomi', 20000, 10, None),
 ('Winnie', 50000, 10, None),
 ('Robert', 70000, 9.8, None),
 ('Jane', 40000, 12.5, 20.0)]